- name: foo
  type: group
  fields:
    - name: code
      type: keyword
    - name: flattened
      type: group
      fields:
        - name: request_parameters
          type: flattened
    - name: constant
      type: constant_keyword
      value: correct
    - name: ip_address
      type: ip
- name: container.image.tag
  type: keyword
  normalize:
  - array
- name: event.category
  type: keyword
  allowed_values:
  - name: authentication
    expected_event_types:
    - start
    - end
    - info
  - name: configuration
    expected_event_types:
    - access
    - change
    - creation
    - deletion
    - info
- name: event.type
  type: keyword
