- name: foo
  type: group
  fields:
    - name: code
      type: keyword
    - name: pid
      type: keyword
    - name: ppid
      type: keyword
    - name: flattened
      type: group
      fields:
        - name: request_parameters
          type: flattened
    - name: constant
      type: constant_keyword
      value: correct
    - name: ip_address
      type: ip
    - name: count
      type: long
    - name: metric
      type: double
- name: container.image.tag
  type: keyword
  normalize:
  - array
- name: event.category
  type: keyword
  allowed_values:
  - name: authentication
    expected_event_types:
    - start
    - end
    - info
  - name: configuration
    expected_event_types:
    - access
    - change
    - creation
    - deletion
    - info
  - name: network
    expected_event_types:
    - access
    - allowed
    - connection
    - denied
    - end
    - info
    - protocol
    - start
  - name: iam
    expected_event_types:
    - admin
    - change
    - creation
    - deletion
    - group
    - info
    - user
- name: event.type
  type: keyword
  normalize:
    - array
  allowed_values:
    - name: access
    - name: admin
    - name: allowed
    - name: change
    - name: connection
    - name: creation
    - name: deletion
    - name: denied
    - name: end
    - name: error
    - name: group
    - name: indicator
    - name: info
    - name: installation
    - name: protocol
    - name: start
    - name: user
- name: process.name
  type: wildcard
  multi_fields:
    - name: text
      type: text
- name: tags
  type: keyword
  normalize:
    - array
- name: user.group.id
  type: keyword
- name: attributes
  type: object
  object_type: keyword
- name: disabled
  type: object
  enabled: false
